tests/requests/example/search_cql_and.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://oss.dbc.dk/ns/opensearch">
  <SOAP-ENV:Body>
    <ns1:searchRequest>
<!-- first and is operator, second is operand. 
   - "anders and" will give same result 
   - change cqleng to cqldan and see error -->
      <ns1:query>anders and and</ns1:query>
      <ns1:agency>100200</ns1:agency>
      <ns1:profile>test</ns1:profile>
      <ns1:queryLanguage>cqleng</ns1:queryLanguage>
      <ns1:queryDebug>1</ns1:queryDebug>
      <ns1:start>1</ns1:start>
      <ns1:stepValue>1</ns1:stepValue>
    </ns1:searchRequest>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
